zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU4_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU4_DLMU_EN_OFF (24u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_DMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_DMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_DMEM_EN_OFF (25u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_DTAG_EN_OFF (26u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU5_PMEM_EN_OFF (27u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU5_PTAG_EN_OFF (28u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU5_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU5_DLMU_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU5_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU5_DLMU_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU5_DLMU_EN */
#define IFX_MTU_MEMTEST0_CPU5_DLMU_EN_OFF (29u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.LMU00_EN */
#define IFX_MTU_MEMTEST0_LMU00_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.LMU00_EN */
#define IFX_MTU_MEMTEST0_LMU00_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.LMU00_EN */
#define IFX_MTU_MEMTEST0_LMU00_EN_OFF (30u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.LMU10_EN */
#define IFX_MTU_MEMTEST0_LMU10_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.LMU10_EN */
#define IFX_MTU_MEMTEST0_LMU10_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.LMU10_EN */
#define IFX_MTU_MEMTEST0_LMU10_EN_OFF (31u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.LMU20_EN */
#define IFX_MTU_MEMTEST1_LMU20_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.LMU20_EN */
#define IFX_MTU_MEMTEST1_LMU20_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.LMU20_EN */
#define IFX_MTU_MEMTEST1_LMU20_EN_OFF (0u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.CPU0_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU0_DMEM1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.CPU0_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU0_DMEM1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.CPU0_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU0_DMEM1_EN_OFF (2u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.CPU1_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU1_DMEM1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.CPU1_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU1_DMEM1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.CPU1_DMEM1_EN */
#define IFX_MTU_MEMTEST1_CPU1_DMEM1_EN_OFF (3u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.DAM0_EN */
#define IFX_MTU_MEMTEST1_DAM0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.DAM0_EN */
#define IFX_MTU_MEMTEST1_DAM0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.DAM0_EN */
#define IFX_MTU_MEMTEST1_DAM0_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.DAM1_EN */
#define IFX_MTU_MEMTEST1_DAM1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.DAM1_EN */
#define IFX_MTU_MEMTEST1_DAM1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.DAM1_EN */
#define IFX_MTU_MEMTEST1_DAM1_EN_OFF (7u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.SADMA_EN */
#define IFX_MTU_MEMTEST1_SADMA_EN_OFF (9u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCDS_EN */
#define IFX_MTU_MEMTEST1_MCDS_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCDS_EN */
#define IFX_MTU_MEMTEST1_MCDS_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCDS_EN */
#define IFX_MTU_MEMTEST1_MCDS_EN_OFF (11u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM0_EN */
#define IFX_MTU_MEMTEST1_EMEM0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM0_EN */
#define IFX_MTU_MEMTEST1_EMEM0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM0_EN */
#define IFX_MTU_MEMTEST1_EMEM0_EN_OFF (12u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM1_EN */
#define IFX_MTU_MEMTEST1_EMEM1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM1_EN */
#define IFX_MTU_MEMTEST1_EMEM1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM1_EN */
#define IFX_MTU_MEMTEST1_EMEM1_EN_OFF (13u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM2_EN */
#define IFX_MTU_MEMTEST1_EMEM2_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM2_EN */
#define IFX_MTU_MEMTEST1_EMEM2_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM2_EN */
#define IFX_MTU_MEMTEST1_EMEM2_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM3_EN */
#define IFX_MTU_MEMTEST1_EMEM3_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM3_EN */
#define IFX_MTU_MEMTEST1_EMEM3_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM3_EN */
#define IFX_MTU_MEMTEST1_EMEM3_EN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.EMEM_XTM_EN */
#define IFX_MTU_MEMTEST1_EMEM_XTM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.EMEM_XTM_EN */
#define IFX_MTU_MEMTEST1_EMEM_XTM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.EMEM_XTM_EN */
#define IFX_MTU_MEMTEST1_EMEM_XTM_EN_OFF (16u)

