zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PMEM_DONE_OFF (12u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU2_PTAG_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU2_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU2_DLMU_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DMEM_DONE_OFF (15u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DTAG_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DLMU_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DMEM_DONE_OFF (20u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DTAG_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PMEM_DONE_OFF (22u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU4_PTAG_DONE_OFF (23u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU4_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU4_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU4_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU4_DLMU_DONE_OFF (24u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DMEM_DONE_OFF (25u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DTAG_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PMEM_DONE_OFF (27u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU5_PTAG_DONE_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU5_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU5_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU5_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU5_DLMU_DONE_OFF (29u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.LMU00_DONE */
#define IFX_MTU_MEMDONE0_LMU00_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.LMU00_DONE */
#define IFX_MTU_MEMDONE0_LMU00_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.LMU00_DONE */
#define IFX_MTU_MEMDONE0_LMU00_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.LMU10_DONE */
#define IFX_MTU_MEMDONE0_LMU10_DONE_LEN (1u)

