zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.LMU10_DONE */
#define IFX_MTU_MEMDONE0_LMU10_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.LMU10_DONE */
#define IFX_MTU_MEMDONE0_LMU10_DONE_OFF (31u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.LMU20_DONE */
#define IFX_MTU_MEMDONE1_LMU20_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.LMU20_DONE */
#define IFX_MTU_MEMDONE1_LMU20_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.LMU20_DONE */
#define IFX_MTU_MEMDONE1_LMU20_DONE_OFF (0u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.DAM1_DONE */
#define IFX_MTU_MEMDONE1_DAM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.DAM1_DONE */
#define IFX_MTU_MEMDONE1_DAM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.DAM1_DONE */
#define IFX_MTU_MEMDONE1_DAM1_DONE_OFF (7u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCDS_DONE */
#define IFX_MTU_MEMDONE1_MCDS_DONE_OFF (11u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM0_DONE */
#define IFX_MTU_MEMDONE1_EMEM0_DONE_OFF (12u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM1_DONE */
#define IFX_MTU_MEMDONE1_EMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM1_DONE */
#define IFX_MTU_MEMDONE1_EMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM1_DONE */
#define IFX_MTU_MEMDONE1_EMEM1_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM2_DONE */
#define IFX_MTU_MEMDONE1_EMEM2_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM2_DONE */
#define IFX_MTU_MEMDONE1_EMEM2_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM2_DONE */
#define IFX_MTU_MEMDONE1_EMEM2_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM3_DONE */
#define IFX_MTU_MEMDONE1_EMEM3_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM3_DONE */
#define IFX_MTU_MEMDONE1_EMEM3_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM3_DONE */
#define IFX_MTU_MEMDONE1_EMEM3_DONE_OFF (15u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.EMEM_XTM_DONE */
#define IFX_MTU_MEMDONE1_EMEM_XTM_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER0_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER0_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER1_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER1_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_BUFFER1_DONE */
#define IFX_MTU_MEMDONE1_SPU_BUFFER1_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG0_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG0_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG1_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG1_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SPU_CONFIG1_DONE */
#define IFX_MTU_MEMDONE1_SPU_CONFIG1_DONE_OFF (20u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_OFF (22u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_OFF (23u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_MSK (0x1u)

