zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.ADDRE */
#define IFX_MTU_MC_ALMSRCS_ADDRE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.ADDRE */
#define IFX_MTU_MC_ALMSRCS_ADDRE_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.OVFE */
#define IFX_MTU_MC_ALMSRCS_OVFE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.OVFE */
#define IFX_MTU_MC_ALMSRCS_OVFE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.OVFE */
#define IFX_MTU_MC_ALMSRCS_OVFE_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.OPENE */
#define IFX_MTU_MC_ALMSRCS_OPENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.OPENE */
#define IFX_MTU_MC_ALMSRCS_OPENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.OPENE */
#define IFX_MTU_MC_ALMSRCS_OPENE_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.MISCE */
#define IFX_MTU_MC_ALMSRCS_MISCE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.MISCE */
#define IFX_MTU_MC_ALMSRCS_MISCE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.MISCE */
#define IFX_MTU_MC_ALMSRCS_MISCE_OFF (5u)

/** \brief Length for Ifx_MTU_MC_FAULTSTS_Bits.OPERR */
#define IFX_MTU_MC_FAULTSTS_OPERR_LEN (6u)

/** \brief Mask for Ifx_MTU_MC_FAULTSTS_Bits.OPERR */
#define IFX_MTU_MC_FAULTSTS_OPERR_MSK (0x3fu)

/** \brief Offset for Ifx_MTU_MC_FAULTSTS_Bits.OPERR */
#define IFX_MTU_MC_FAULTSTS_OPERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_FAULTSTS_Bits.MISCERR */
#define IFX_MTU_MC_FAULTSTS_MISCERR_LEN (6u)

/** \brief Mask for Ifx_MTU_MC_FAULTSTS_Bits.MISCERR */
#define IFX_MTU_MC_FAULTSTS_MISCERR_MSK (0x3fu)

/** \brief Offset for Ifx_MTU_MC_FAULTSTS_Bits.MISCERR */
#define IFX_MTU_MC_FAULTSTS_MISCERR_OFF (8u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.SBERR */
#define IFX_MTU_MC_ERRINFO_SBERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.SBERR */
#define IFX_MTU_MC_ERRINFO_SBERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.SBERR */
#define IFX_MTU_MC_ERRINFO_SBERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.DBERR */
#define IFX_MTU_MC_ERRINFO_DBERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.DBERR */
#define IFX_MTU_MC_ERRINFO_DBERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.DBERR */
#define IFX_MTU_MC_ERRINFO_DBERR_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ERRINFO_Bits.ADDRERR */
#define IFX_MTU_MC_ERRINFO_ADDRERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ERRINFO_Bits.ADDRERR */
#define IFX_MTU_MC_ERRINFO_ADDRERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ERRINFO_Bits.ADDRERR */
#define IFX_MTU_MC_ERRINFO_ADDRERR_OFF (2u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMTU_BF_H */
